my_list = ['яблоко', 'банан', 'киви', 'ананас', 'арбуз', 'виноград']
print("Список фруктов:", my_list)
print("Первый элемент:", my_list[0])
print("Последний элемент:", my_list[-1])
print("Элементы с третьего по пятый:", my_list[2:5])
my_list[2] = 'груша'
print("Измененный список фруктов:", my_list)
my_dict = {'apple': 'яблоко', 'banana': 'банан', 'kiwi': 'киви'}
print("Список фруктов с переводом:", my_dict)
print("Перевод слова 'banana':", my_dict['banana'])
my_dict['kiwi'] = 'арбуз'
print("Измененный список фруктов:", my_dict)